In [1]:
import pandas as pd
from sqlalchemy.types import *
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Title Basics

In [2]:
basics = pd.read_csv("Data/title_basics.csv.gz", low_memory = False)
basics.info()
basics.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11554 entries, 0 to 11553
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          11554 non-null  object
 1   titleType       11554 non-null  object
 2   primaryTitle    11554 non-null  object
 3   originalTitle   11554 non-null  object
 4   isAdult         11554 non-null  int64
 5   startYear       11554 non-null  int64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  11554 non-null  int64
 8   genres          11554 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 812.5+ KB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance"
1,tt0113092,movie,For the Cause,For the Cause,0,2000,NaN,100,"Action,Adventure,Drama"
2,tt0115937,movie,Consequence,Consequence,0,2000,NaN,91,Drama

In [3]:
## create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0113026,movie,The Fantasticks,The Fantasticks,0,2000,NaN,86,"Musical,Romance","[Musical, Romance]"
1,tt0113092,movie,For the Cause,For the Cause,0,2000,NaN,100,"Action,Adventure,Drama","[Action, Adventure, Drama]"
2,tt0115937,movie,Consequence,Consequence,0,2000,NaN,91,Drama,[Drama]
3,tt0116391,movie,Gang,Gang,0,2000,NaN,167,"Action,Crime,Drama","[Action, Crime, Drama]"
4,tt0116628,movie,The Incorporated,The Incorporated,0,2000,NaN,86,"Action,Thriller","[Action, Thriller]"
...,...,...,...,...,...,...,...,...,...,...
11549,tt9896876,movie,India Sweets and Spices,India Sweets and Spices,0,2021,NaN,101,Comedy,[Comedy]
11550,tt9898844,movie,The Hunting,The Hunting,0,2021,NaN,93,"Horror,Mystery,Thriller","[Horror, Mystery, Thriller]"
11551,tt9900940,movie,Scrapper,The Scrapper,0,2021,NaN,87,"Crime,Drama,Thriller","[Crime, Drama, Thriller]"
11552,tt9904648,movie,The Contrast,The Contrast,0,2022,NaN,82,Comedy,[Comedy]
11553,tt9907782,movie,The Cursed,Eight for Silver,0,2021,NaN,111,"Fantasy,Horror,Mystery","[Fantasy, Horror, Mystery]"

In [4]:
basics = basics.drop(columns = ['originalTitle','isAdult','titleType','genres'])

In [5]:
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,endYear,runtimeMinutes,genres_split
0,tt0113026,The Fantasticks,2000,NaN,86,Musical
0,tt0113026,The Fantasticks,2000,NaN,86,Romance
1,tt0113092,For the Cause,2000,NaN,100,Action
1,tt0113092,For the Cause,2000,NaN,100,Adventure
1,tt0113092,For the Cause,2000,NaN,100,Drama
...,...,...,...,...,...,...
11551,tt9900940,Scrapper,2021,NaN,87,Thriller
11552,tt9904648,The Contrast,2022,NaN,82,Comedy
11553,tt9907782,The Cursed,2021,NaN,111,Fantasy
11553,tt9907782,The Cursed,2021,NaN,111,Horror
11553,tt9907782,The Cursed,2021,NaN,111,Mystery

In [6]:
# get the unique genres and sorted function to get the genres sorted alphabetically
unique_genres = sorted(exploded_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [7]:
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0113026      Musical
0  tt0113026      Romance
1  tt0113092       Action
1  tt0113092    Adventure
1  tt0113092        Drama

In [8]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [9]:
## make new integer genre_id and drop string genres
title_genres['genre_id'] = title_genres['genres_split'].map(genre_map)
title_genres

          tconst genres_split  genre_id
0      tt0113026      Musical        14
0      tt0113026      Romance        18
1      tt0113092       Action         0
1      tt0113092    Adventure         2
1      tt0113092        Drama         7
...          ...          ...       ...
11551  tt9900940     Thriller        23
11552  tt9904648       Comedy         5
11553  tt9907782      Fantasy         9
11553  tt9907782       Horror        12
11553  tt9907782      Mystery        15

[20817 rows x 3 columns]

In [10]:
title_genres = title_genres.drop(columns = 'genres_split')
basics = basics.drop(columns = 'genres_split')

In [11]:
title_genres.head(3)

      tconst  genre_id
0  tt0113026        14
0  tt0113026        18
1  tt0113092         0

In [26]:
genre_lookup = pd.DataFrame({'genre_name': genre_map.keys(),
                            'genre_id':genre_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [13]:
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
print(f'Max Key Length: {key_len}')
print(f'Max Title Length: {title_len}')
      
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text,
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

Max Key Length: 10
Max Title Length: 121

In [14]:
# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
username = "root"
password = "root" # (or whatever password you chose during mysql installation)
db_name = "movies"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)

# Check if the database exists. If not, create it.
if database_exists(connection) == False:
  create_database(connection)
else:
  print('The database already exists')

The database already exists

In [15]:
# Save to sql with dtype and index=False
basics.to_sql('title_basics', engine, dtype=df_schema, if_exists='replace', index=False)

11554

In [16]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [17]:
basics.head(3)

      tconst     primaryTitle  startYear  endYear  runtimeMinutes
0  tt0113026  The Fantasticks       2000      NaN              86
1  tt0113092    For the Cause       2000      NaN             100
2  tt0115937      Consequence       2000      NaN              91

In [18]:
# Save to sql with dtype and index=False
title_genres.to_sql('title_genres', engine, dtype=df_schema, if_exists='replace', index=False)
title_genres.head(3)

      tconst  genre_id
0  tt0113026        14
0  tt0113026        18
1  tt0113092         0

In [19]:
# Save to sql with dtype and index=False
genre_lookup.to_sql('genres', engine, dtype=df_schema, if_exists='replace', index=False)
genre_lookup.head(3)

  genre_Name  genre_ID
0     Action         0
1      Adult         1
2  Adventure         2

In [27]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

# Title Ratings

In [20]:
ratings = pd.read_csv("Data/title_ratings.csv.gz", low_memory = False)
ratings.info()
ratings.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 499224 entries, 0 to 499223
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         499224 non-null  object
 1   averageRating  499224 non-null  float64
 2   numVotes       499224 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 11.4+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1972
1  tt0000002            5.8       263
2  tt0000005            6.2      2614

In [21]:
# Save to sql with dtype and index=False
ratings.to_sql('title_ratings', engine, dtype=df_schema, if_exists='replace', index=False)

499224

In [22]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

# TMDB Data

In [23]:
tmdb = pd.read_csv("Data/tmdb_results_combined.csv.gz", low_memory = False)
tmdb.info()
tmdb.head(3)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4611 entries, 0 to 4610
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                4611 non-null   object
 1   adult                  4609 non-null   float64
 2   backdrop_path          1972 non-null   object
 3   belongs_to_collection  356 non-null    object
 4   budget                 4609 non-null   float64
 5   genres                 4609 non-null   object
 6   homepage               271 non-null    object
 7   id                     4609 non-null   float64
 8   original_language      4609 non-null   object
 9   original_title         4609 non-null   object
 10  overview               4503 non-null   object
 11  popularity             4609 non-null   float64
 12  poster_path            3975 non-null   object
 13  production_companies   4609 non-null   object
 14  production_countries   4609 non-null   object
 15  release_date           4549 non-null   object
 16  revenue                4609 non-null   float64
 17  runtime                4609 non-null   float64
 18  spoken_languages       4609 non-null   object
 19  status                 4609 non-null   object
 20  tagline                1693 non-null   object
 21  title                  4609 non-null   object
 22  video                  4609 non-null   float64
 23  vote_average           4609 non-null   float64
 24  vote_count             4609 non-null   float64
 25  certification          1481 non-null   object
dtypes: float64(9), object(17)
memory usage: 936.7+ KB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0113026,0.0,/vMFs7nw6P0bIV1jDsQpxAieAVnH.jpg,NaN,10000000.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10402, '...",NaN,62127.0,en,The Fantasticks,...,0.0,86.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Try to remember the first time magic happened,The Fantasticks,0.0,5.5,22.0,NaN
2,tt0113092,0.0,NaN,NaN,0.0,"[{'id': 878, 'name': 'Science Fiction'}]",NaN,110977.0,en,For the Cause,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The ultimate showdown on a forbidden planet.,For the Cause,0.0,5.1,8.0,NaN

In [28]:
tmdb = tmdb[['imdb_id','revenue','budget','certification']]
tmdb.head(3)

     imdb_id  revenue      budget certification
0          0      NaN         NaN           NaN
1  tt0113026      0.0  10000000.0           NaN
2  tt0113092      0.0         0.0           NaN

In [32]:
tmdb = tmdb.drop(tmdb.index[0]).reset_index(drop=True)
tmdb.rename(columns={'imdb_id': 'tconst'}, inplace=True)
tmdb.head(3)

      tconst     revenue    budget certification
0  tt0113092         0.0       0.0           NaN
1  tt0116391         0.0       0.0           NaN
2  tt0118694  12854953.0  150000.0            PG

In [34]:
# Save to sql with dtype and index=False
tmdb.to_sql('tmdb_data', engine, dtype=df_schema, if_exists='replace', index=False)

4609

In [35]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`tconst`);')

In [37]:
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data